================================================================================
COMMENT statement
================================================================================

/* comment */

--------------------------------------------------------------------------------

(source_code
	(statement
		(comment)))


================================================================================
VARIABLE DEFINITION statement
================================================================================

DEFINE VARIABLE full_variable AS INTEGER.
DEFINE VAR  full_var AS INTEGER.

DEF VARIABLE short_variable AS INTEGER.
DEF VAR short_var AS INTEGER.

--------------------------------------------------------------------------------

(source_code
	(statement
		(variable_definition
			(identifier)
			(primitive_type)
			(terminator)))
	(statement
		(variable_definition
			(identifier)
			(primitive_type)
			(terminator)))
	(statement
		(variable_definition
			(identifier)
			(primitive_type)
			(terminator)))
	(statement
		(variable_definition
			(identifier)
			(primitive_type)
			(terminator))))


================================================================================
VARIABLE ASSIGNMENT statement
================================================================================

DEFINE VARIABLE variable AS INTEGER.
variable = 5.

--------------------------------------------------------------------------------


(source_code
	(statement
		(variable_definition
			(identifier)
			(primitive_type)
			(terminator)))
	(statement
		(variable_assignment
		  (assignment
			  (identifier)
				(expression
				  (number_literal)))
			(terminator))))	
			
================================================================================
IF statement
================================================================================

IF x > 10 THEN DO:
	x = 10.
END.

--------------------------------------------------------------------------------

(source_code
	(statement
		(if_statement
			(if_do_statement
				(conditions
					(expression
						(comparison
							(expression
								(identifier))
							(expression
								(number_literal)))))
				(statement
					(variable_assignment
						(assignment
							(identifier)
							(expression
								(number_literal)))
						(terminator)))
				(block_terminator)))))

================================================================================
IF ELSE DO statement
================================================================================

IF x > 10 THEN DO:
	x = 10.
END.
ELSE DO:
  x = x.
END.

--------------------------------------------------------------------------------

(source_code
	(statement
		(if_statement
			(if_do_statement
				(conditions
					(expression
						(comparison
							(expression
								(identifier))
							(expression
								(number_literal)))))
				(statement
					(variable_assignment
						(assignment
							(identifier)
							(expression
								(number_literal)))
						(terminator)))						
				(block_terminator)
				(else_do_statement
					(statement
						(variable_assignment
							(assignment
								(identifier)
								(expression
									(identifier)))
							(terminator)))
					(block_terminator))))))

================================================================================
IF ELSE IF statement
================================================================================

IF x > 10 THEN DO:
	x = 10.
END.
ELSE IF x < 10 OR x = 0 THEN DO:
  x = x.
END.
ELSE DO:
	x = x.
END.

--------------------------------------------------------------------------------

(source_code
	(statement
		(if_statement
			(if_do_statement
				(conditions
					(expression
						(comparison
							(expression
								(identifier))
							(expression
								(number_literal)))))
				(statement
					(variable_assignment
						(assignment
							(identifier)
							(expression
								(number_literal)))
						(terminator)))						
				(block_terminator)
				(else_do_if_statement
					(conditions
						(expression
							(comparison
								(expression
									(identifier))
								(expression
									(number_literal))))
						(expression
							(comparison
								(expression
									(identifier))
								(expression
									(number_literal)))))
					(statement
						(variable_assignment
							(assignment
								(identifier)
								(expression
									(identifier)))
							(terminator)))
					(block_terminator))
				(else_do_statement
					(statement
						(variable_assignment
							(assignment
								(identifier)
								(expression
									(identifier)))
							(terminator)))
					(block_terminator))))))

================================================================================
IF THEN statement
================================================================================

IF x > 10 THEN x = 10.

--------------------------------------------------------------------------------

(source_code
	(statement
		(if_statement
			(if_then_statement
				(conditions
					(expression
						(comparison
							(expression
								(identifier))
							(expression
								(number_literal)))))
				(terminated_statement
					(variable_assignment
						(assignment
							(identifier)
							(expression
								(number_literal)))
						(terminator)))))))

================================================================================
IF ELSE THEN statement
================================================================================

IF x > 10 THEN x = 10.
ELSE x = x.

--------------------------------------------------------------------------------

(source_code
	(statement
		(if_statement
			(if_then_statement
			  (conditions
					(expression
						(comparison
							(expression
								(identifier))
							(expression
								(number_literal)))))
				(terminated_statement
					(variable_assignment
						(assignment
							(identifier)
							(expression
								(number_literal)))
						(terminator)))
				(else_then_statement
					(terminated_statement
						(variable_assignment
							(assignment
								(identifier)
								(expression
									(identifier)))
							(terminator))))))))


================================================================================
ABL (simple multi) statement
================================================================================

DISPLAY "test" a 5 f().

--------------------------------------------------------------------------------

(source_code
	(statement
		(abl_statement
			(expression
				(string_literal
					(double_quoted_string)))
			(expression
				(identifier))
			(expression
				(number_literal))
			(expression
				(function_call
					(identifier)))
			(terminator))))

================================================================================
ASSIGN statement
================================================================================

ASSIGN 
	a = 1
	b = "ABC"
	c = f()
.

--------------------------------------------------------------------------------


(source_code
	(statement
		(abl_statement
			(assign_statement
				(assignment
					(identifier)
					(expression
						(number_literal)))
				(assignment
					(identifier)
					(expression
						(string_literal
							(double_quoted_string))))
				(assignment
					(identifier)
					(expression
						(function_call
							(identifier))))
						(terminator)))))